Merge pull request #101 from LosPapois/bugs2
Enhance documentation with Mermaid diagrams and color palette
